backend/hoppy-hunter/app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
  def index
    @beers = Beer.all

INSERT INTO "beers" ("name", "style", "abv", "img_src", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["style", "Ale"], ["abv", "7.5"], ["img_src", "wefqerg"], ["brewery_id", 15], ["created_at", "2020-09-21 18:23:14.639884"], ["updated_at", "2020-09-21 18:23:14.639884"]]
---
  def create
    @beer = Beer.new(beer_params)

    if @beer.save

DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 2]]
---
  def destroy
    @beer.destroy

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_beer
      @beer = Beer.find(params[:id])