backend/hoppy-hunter/app/controllers/breweries_controller.rb

  def index
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def create
    @brewery = Brewery.new(brewery_params)

    if @brewery.save
---
INSERT INTO "breweries" ("name", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Dogfish Head"], ["location", "Delaware"], ["created_at", "2020-09-21 02:01:01.979116"], ["updated_at", "2020-09-21 02:01:01.979116"]]

  def destroy
    @brewery.destroy
---
DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 7]]

    def set_brewery
      @brewery = Brewery.find(params[:id])
---
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]